[
  {
          "name": "Robert",
          "comment": "The weekend was a gift. I loved meeting other couples who are taking their marriage vows seriously (and playfully) and having some of my preset ideas of what marriage was about stretched (in a good way)."
  },
  {
          "name": "Lana & Paul",
          "comment": "We did the Engaged Encounter Weekend, and thoroughly enjoyed the experience. It gives couples a forum to discuss their feelings in an open, honest and trusting manner. We also met some other fabulous couples whilst we were there, who are all going through the same life event so we had lots in common and it was lovely to hear about other people's wedding plans. Really enjoyed it - thanks."
  },
  {
          "name": "Rachael",
          "comment": "Really appreciated the talks especially the openness of them."
  },
  {
          "name": "Andrew",
          "comment": "Best thing I have done for 'us' in a long, long time. So helpful to our relationship. It was fantastic to have a weekend to solely concentrate on my partner without the pressures of the world"
  },
  {
          "name": "Radha",
          "comment": "Thank you for this weekend. We really valued the privacy and the time to explore our relationship further. It was wonderful to reaffirm our love and commitment and confirm that we are on the right track"
  },
  {
          "name": "Jonathan",
          "comment": "Tremendous benefit to me and I learnt a lot about myself and how best to communicate, get through problems, etc. I feel so much better about our marriage and our life together"
  },
  {
          "name": "Mark",
          "comment": "We became more certain of our decision to marry. "
  },
  {
          "name": "Caitlyn",
          "comment": "It gave us time to enjoy each other with no distractions. A lot of topics made us think and reminded us to keep our lines of communication open."
  },
  {
          "name": "Murray",
          "comment": "As a non-Catholic, I was very hesitant in relation to the non-acceptance of other Christian denominations at a Catholic Church weekend. I was very pleased that you were very open to other denominations and made us feel welcome. I got an understanding of some of the Catholic beliefs of my partner"
  },
  {
          "name": "Gary",
          "comment": "Being a non-catholic I was dreading the weekend. In the end I found it enjoyable and informative and I will recommend it to others."
  },
  {
          "name": "Vicky",
          "comment": "A fantastic and inspiring weekend. I feel it has benefitted our relationship. Having the opportunity and time to talk intimately to each other with no interuptions was great and I found it rewarding listening to the presenting couples' very deep and personal experiences. We will really encourage all our engaged friends and those considering marriage to attend."
  },
  {
          "name": "Chris",
          "comment": "As an atheist I was a little concerned about what would happen but as soon as the talks started I was overwhelmingly glad to be here. I think EE provides an excellent coverage of what many people do not realise - relationships need work, need skills and tools (especially for communication and forgiveness). I think every couple who is involved in a serious relationship should be here."
  }
]
