[
  {
          "name": "Rachael",
          "comment": "Really appreciated the talks especially the openness of them."
  },
  {
          "name": "Andrew",
          "comment": "Best thing I have done for 'us' in a long, long time. So helpful to our relationship. It was fantastic to have a weekend to solely concentrate on my partner without the pressures of the world"
  },
  {
          "name": "Radha",
          "comment": "Thank you for this weekend. We really valued the privacy and the time to explore our relationship further. It was wonderful to reaffirm our love and commitment and confirm that we are on the right track"
  },
  {
          "name": "Jonathan",
          "comment": "Tremendous benefit to me and I learnt a lot about myself and how best to communicate, get through problems, etc. I feel so much better about our marriage and our life together"
  },
  {
          "name": "Mark",
          "comment": "We became more certain of our decision to marry. "
  },
  {
          "name": "Amy",
          "comment": "We have grown to love each other more, yet when we arrived on Friday night, we thought that would not be possible."
  },
  {
          "name": "Caitlyn",
          "comment": "It gave us time to enjoy each other with no distractions. A lot of topics made us think and reminded us to keep our lines of communication open."
  },
  {
          "name": "Murray",
          "comment": "As a non-Catholic, I was very hesitant in relation to the non-acceptance of other Christian denominations at a Catholic Church weekend. I was very pleased that you were very open to other denominations and made us feel welcome. I got an understanding of some of the Catholic beliefs of my partner"
  },
  {
          "name": "Gary",
          "comment": "Being a non-catholic I was dreading the weekend. In the end I found it enjoyable and informative and I will recommend it to others."
  },
  {
          "name": "Vicky",
          "comment": "A fantastic and inspiring weekend. I feel it has benefitted our relationship. Having the opportunity and time to talk intimately to each other with no interuptions was great and I found it rewarding listening to the presenting couples' very deep and personal experiences. We will really encourage all our engaged friends and those considering marriage to attend."
  },
  {
          "name": "Chris",
          "comment": "As an atheist I was a little concerned about what would happen but as soon as the talks started I was overwhelmingly glad to be here. I think EE provides an excellent coverage of what many people do not realise - relationships need work, need skills and tools (especially for communication and forgiveness). I think every couple who is involved in a serious relationship should be here."
  },
  {
          "name": "Tina and Nick Giera",
          "comment": "Tina and I were married in the Waihi catholic church near Turangi. As a requirement for our marriage preparation we travelled from Hawkes Bay for the CEE and had little idea what to expect of our weekend in Wellington. Tina, being a non-catholic, felt quite apprehensive about the weekend, and I felt obliged to go as part of the requirements for getting married. We were in for a good surprise. Right from the start the openness and honesty of the lead (married) couples made us feel touched that they would share such personal experiences for the benefit of the young couples gathered. Sharing their experiences of married life with the group also made us feel obliged to share openly with each other and later with the group. Having the presenters as such down to earth, approachable couples was important for making the weekend a success. The format of describing potential issues to be expected in our married life together, writing our thoughts individually and then sharing them with each other was a great way to share views without the complications of face to face discussion. It was a good way to answer the questions honestly. Over the two days the group was spread around the grounds scribbling in note books so we were also lucky with the weather. While not keen on the idea prior to the weekend, staying on site was the best way of removing all potential distractions from a weekend in Wellington. This helped us focus on what would be one of the most important steps we would make in our lives. It also gave us a good break from the task of organising the wedding day. We were made to think hard about what we were getting ourselves in for, an opportunity we may not have taken otherwise. We discussed a whole range of issues over the weekend. These ranged from religion, starting a family, our values and beliefs, and money. Many of these topics we had never talked abut before and haven't really touched on since. However, by taking the time to write down our thoughts and feelings on these issues Tina and I discovered new things about each other's values and why they were important. Driving away from Wellington we both felt that we were very lucky to have attended the course and felt a lot closer to one another. We knew that we had gained a lot from the weekend although found it difficult to describe the experience to many of our friends. Despite the big group it was a really personal time and we gained insights into our future life together that we never expected or considered. Tina and I have referred to our note books a few times over the first year of our marriage, sometimes when we need reminding about why we fell in love, and more recently, why we have committed to loving each other in our marriage. With family now expected soon, we're sure this commitment will be tested plenty of times but feel confident that it was a good decision. We would recommend the CEE weekend to anyone preparing for marriage. Even though the weekend is run by the Catholic Church, any couple would benefit from the course and not feel overwhelmed by topics that specifically deal with religious issues. It was really important for us and we are very grateful to those who organised the course and shared their experience of marriage so openly with us."
  }
]
